CfdOfRuns/FlowInCyl/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          8640;
        startFace       119058;
    }
    inlet
    {
        type            patch;
        nFaces          362;
        startFace       127698;
    }
    outlet
    {
        type            patch;
        nFaces          362;
        startFace       128060;
    }
    defaultFaces
    {
        type            patch;
        nFaces          0;
        startFace       128422;
    }
)

// ************************************************************************* //
